---
title: MEPCalculationFailures
classe: Autodesk.Revit.DB.BuiltInFailures+MEPCalculationFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 43
---

# MEPCalculationFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId AtLeastOneEquipmentOnDuty { get; }` | `MEPCalculationFailures.AtLeastOneEquipmentOnDuty` | FailureDefinitionId |
| `FailureDefinitionId ClassificationNotSetInFamily { get; }` | `MEPCalculationFailures.ClassificationNotSetInFamily` | FailureDefinitionId |
| `FailureDefinitionId DemandFlowNotSetInLossFamily { get; }` | `MEPCalculationFailures.DemandFlowNotSetInLossFamily` | FailureDefinitionId |
| `FailureDefinitionId DuctFittingAndAccessoryPressureDropCalculatorNotAvailable { get; }` | `MEPCalculationFailures.DuctFittingAndAccessoryPressureDropCalculatorNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId DuctPressureDropCalculatorNotAvailable { get; }` | `MEPCalculationFailures.DuctPressureDropCalculatorNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId ExtraPumpSet { get; }` | `MEPCalculationFailures.ExtraPumpSet` | FailureDefinitionId |
| `FailureDefinitionId FlowAndPressureCalculationMethodHasBeenImproved { get; }` | `MEPCalculationFailures.FlowAndPressureCalculationMethodHasBeenImproved` | FailureDefinitionId |
| `FailureDefinitionId HydraulicSeparationAmbiguity { get; }` | `MEPCalculationFailures.HydraulicSeparationAmbiguity` | FailureDefinitionId |
| `FailureDefinitionId HydraulicSeparationOfOneSystem { get; }` | `MEPCalculationFailures.HydraulicSeparationOfOneSystem` | FailureDefinitionId |
| `FailureDefinitionId InvalidFluidProperty { get; }` | `MEPCalculationFailures.InvalidFluidProperty` | FailureDefinitionId |
| `FailureDefinitionId InvalidNumberOfMechanicalEquipmentOnDuty { get; }` | `MEPCalculationFailures.InvalidNumberOfMechanicalEquipmentOnDuty` | FailureDefinitionId |
| `FailureDefinitionId LoopSeparationNotCompleted { get; }` | `MEPCalculationFailures.LoopSeparationNotCompleted` | FailureDefinitionId |
| `FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; }` | `MEPCalculationFailures.MechanicalEquipmentSetBeingDeleted` | FailureDefinitionId |
| `FailureDefinitionId Network_ElementNodeIsNotPartOfNetwork { get; }` | `MEPCalculationFailures.Network_ElementNodeIsNotPartOfNetwork` | FailureDefinitionId |
| `FailureDefinitionId Network_NodePropertyNotSet { get; }` | `MEPCalculationFailures.Network_NodePropertyNotSet` | FailureDefinitionId |
| `FailureDefinitionId Network_NoInputNode { get; }` | `MEPCalculationFailures.Network_NoInputNode` | FailureDefinitionId |
| `FailureDefinitionId Network_NoOutputNode { get; }` | `MEPCalculationFailures.Network_NoOutputNode` | FailureDefinitionId |
| `FailureDefinitionId Network_NoPressureConstraint { get; }` | `MEPCalculationFailures.Network_NoPressureConstraint` | FailureDefinitionId |
| `FailureDefinitionId Network_NotEnoughElements { get; }` | `MEPCalculationFailures.Network_NotEnoughElements` | FailureDefinitionId |
| `FailureDefinitionId Network_NotEnoughNodes { get; }` | `MEPCalculationFailures.Network_NotEnoughNodes` | FailureDefinitionId |
| `FailureDefinitionId Network_NotFullyConnected { get; }` | `MEPCalculationFailures.Network_NotFullyConnected` | FailureDefinitionId |
| `FailureDefinitionId Network_OverConstrained { get; }` | `MEPCalculationFailures.Network_OverConstrained` | FailureDefinitionId |
| `FailureDefinitionId NetworkCanNotDeterminCriticalPath { get; }` | `MEPCalculationFailures.NetworkCanNotDeterminCriticalPath` | FailureDefinitionId |
| `FailureDefinitionId NetworkDefaultToPressure { get; }` | `MEPCalculationFailures.NetworkDefaultToPressure` | FailureDefinitionId |
| `FailureDefinitionId NetworkDefaultToReynolds { get; }` | `MEPCalculationFailures.NetworkDefaultToReynolds` | FailureDefinitionId |
| `FailureDefinitionId NetworkEnergyEquationNotConverge { get; }` | `MEPCalculationFailures.NetworkEnergyEquationNotConverge` | FailureDefinitionId |
| `FailureDefinitionId NetworkErrorCalculatingPressure { get; }` | `MEPCalculationFailures.NetworkErrorCalculatingPressure` | FailureDefinitionId |
| `FailureDefinitionId NetworkErrorElementWithDownUpStreamNode { get; }` | `MEPCalculationFailures.NetworkErrorElementWithDownUpStreamNode` | FailureDefinitionId |
| `FailureDefinitionId NetworkErrorExtractCurveData { get; }` | `MEPCalculationFailures.NetworkErrorExtractCurveData` | FailureDefinitionId |
| `FailureDefinitionId NetworkErrorModelTooBig { get; }` | `MEPCalculationFailures.NetworkErrorModelTooBig` | FailureDefinitionId |
| `FailureDefinitionId NetworkErrorOverConstrained { get; }` | `MEPCalculationFailures.NetworkErrorOverConstrained` | FailureDefinitionId |
| `FailureDefinitionId NetworkExtraPumpOutsideSet { get; }` | `MEPCalculationFailures.NetworkExtraPumpOutsideSet` | FailureDefinitionId |
| `FailureDefinitionId NetworkInconsistentDemandFlow { get; }` | `MEPCalculationFailures.NetworkInconsistentDemandFlow` | FailureDefinitionId |
| `FailureDefinitionId NetworkMinorLossNotConverge { get; }` | `MEPCalculationFailures.NetworkMinorLossNotConverge` | FailureDefinitionId |
| `FailureDefinitionId NetworkPressureNotConverge { get; }` | `MEPCalculationFailures.NetworkPressureNotConverge` | FailureDefinitionId |
| `FailureDefinitionId NetworkUnderConstrained { get; }` | `MEPCalculationFailures.NetworkUnderConstrained` | FailureDefinitionId |
| `FailureDefinitionId PipeConnectorsAreNotLined { get; }` | `MEPCalculationFailures.PipeConnectorsAreNotLined` | FailureDefinitionId |
| `FailureDefinitionId PipeFittingAndAccessoryPressureDropCalculatorNotAvailable { get; }` | `MEPCalculationFailures.PipeFittingAndAccessoryPressureDropCalculatorNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId PipePressureDropCalculatorNotAvailable { get; }` | `MEPCalculationFailures.PipePressureDropCalculatorNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId PlumbingFlowCalculatorNotAvailable { get; }` | `MEPCalculationFailures.PlumbingFlowCalculatorNotAvailable` | FailureDefinitionId |
| `FailureDefinitionId PumpPressureNotComputed { get; }` | `MEPCalculationFailures.PumpPressureNotComputed` | FailureDefinitionId |
| `FailureDefinitionId SeparationNotAtJunction { get; }` | `MEPCalculationFailures.SeparationNotAtJunction` | FailureDefinitionId |
| `FailureDefinitionId SeparationWithOddJunction { get; }` | `MEPCalculationFailures.SeparationWithOddJunction` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```